In [1]:
#calculo
import numpy as np
import pandas as pd

#grafico
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

set_parameter_csv = {
    'sep': ',',
    'encoding': 'ISO-8859-1',
    'low_memory': False
}

data = pd.read_csv(
    '../data/athlete_events.csv', **set_parameter_csv
)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [2]:
# UNiformizamos el nombre de las columnas a uno sin espacios, ni tildes ni mayusculas
from django.utils.text import slugify
data.columns = [
    slugify(_).replace('-', '_') for _ in list(data.columns)
]
data.columns

Index(['id', 'name', 'sex', 'age', 'height', 'weight', 'team', 'noc', 'games',
       'year', 'season', 'city', 'sport', 'event', 'medal'],
      dtype='object')

In [3]:
data.describe()

,id,age,height,weight,year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [4]:
data.describe(include=['object', 'bool'])

,name,sex,team,noc,games,season,city,sport,event,medal
count,271116,271116,271116,271116,271116,271116,271116,271116,271116,39783
unique,134732,2,1184,230,51,2,42,66,765,3
top,Robert Tait McKenzie,M,United States,USA,2000 Summer,Summer,London,Athletics,Football Men's Football,Gold
freq,58,196594,17847,18853,13821,222552,22426,38624,5733,13372

# 1. How old were the youngest male and female participants of the 1996 Olympics?

In [5]:
# ¿Qué edad tenían los participantes masculinos y femeninos más jóvenes de los Juegos Olímpicos de 1996?
data['games'].unique()

array(['1992 Summer', '2012 Summer', '1920 Summer', '1900 Summer',
       '1988 Winter', '1992 Winter', '1994 Winter', '1932 Summer',
       '2002 Winter', '1952 Summer', '1980 Winter', '2000 Summer',
       '1996 Summer', '1912 Summer', '1924 Summer', '2014 Winter',
       '1948 Summer', '1998 Winter', '2006 Winter', '2008 Summer',
       '2016 Summer', '2004 Summer', '1960 Winter', '1964 Winter',
       '1984 Winter', '1984 Summer', '1968 Summer', '1972 Summer',
       '1988 Summer', '1936 Summer', '1952 Winter', '1956 Winter',
       '1956 Summer', '1960 Summer', '1928 Summer', '1976 Summer',
       '1980 Summer', '1964 Summer', '2010 Winter', '1968 Winter',
       '1906 Summer', '1972 Winter', '1976 Winter', '1924 Winter',
       '1904 Summer', '1928 Winter', '1908 Summer', '1948 Winter',
       '1932 Winter', '1936 Winter', '1896 Summer'], dtype=object)

In [6]:
data['year'] = data['games'].apply(lambda x: int(x.split()[0]))

In [7]:
data[data['year'] == 1996].groupby(by=['sex']).min()['age']

sex
F    12.0
M    14.0
Name: age, dtype: float64

# 2. What was the percentage of male gymnasts among all the male participants of the 2000 Olympics? Round the answer to the first decimal.

In [8]:
data['sport'].unique()

array(['Basketball', 'Judo', 'Football', 'Tug-Of-War', 'Speed Skating',
       'Cross Country Skiing', 'Athletics', 'Ice Hockey', 'Swimming',
       'Badminton', 'Sailing', 'Biathlon', 'Gymnastics',
       'Art Competitions', 'Alpine Skiing', 'Handball', 'Weightlifting',
       'Wrestling', 'Luge', 'Water Polo', 'Hockey', 'Rowing', 'Bobsleigh',
       'Fencing', 'Equestrianism', 'Shooting', 'Boxing', 'Taekwondo',
       'Cycling', 'Diving', 'Canoeing', 'Tennis', 'Modern Pentathlon',
       'Figure Skating', 'Golf', 'Softball', 'Archery', 'Volleyball',
       'Synchronized Swimming', 'Table Tennis', 'Nordic Combined',
       'Baseball', 'Rhythmic Gymnastics', 'Freestyle Skiing',
       'Rugby Sevens', 'Trampolining', 'Beach Volleyball', 'Triathlon',
       'Ski Jumping', 'Curling', 'Snowboarding', 'Rugby',
       'Short Track Speed Skating', 'Skeleton', 'Lacrosse', 'Polo',
       'Cricket', 'Racquets', 'Motorboating', 'Military Ski Patrol',
       'Croquet', 'Jeu De Paume', 'Roque', 'Alpinism', 'Basque Pelota',
       'Aeronautics'], dtype=object)

In [21]:
#2. ¿Cuál fue el porcentaje de gimnastas masculinos entre todos los participantes 
# masculinos de los Juegos Olímpicos del 2000? Redondea la respuesta al primer decimal.

masculinos_2000 = data[
    (data['year'] == 2000) & (data['sex'] == 'M')
].drop_duplicates(
    subset=['name']
)


masculinos_2000_gym = masculinos_2000[
    masculinos_2000['sport'] == 'Gymnastics'
]

In [22]:
np.round(
    (masculinos_2000_gym.shape[0] / masculinos_2000.shape[0]) * 100, 1
)

1.5

# 3. What are the mean and standard deviation of height for female basketball players participated in the 2000 Olympics? Round the answer to the first decimal.

In [55]:
# ¿Cuáles son la media y la desviación estándar de altura para las jugadoras de baloncesto que 
# participaron en los Juegos Olímpicos de 2000? Redondea la respuesta al primer decimal.

jugadoras_2000_basketball = data[
    (data['year'] == 2000) & (data['sex'] == 'F') & (data['sport'] == 'Basketball')
].agg(
    ['mean', 'std']
).apply(lambda _: np.round(_, 1))

jugadoras_2000_basketball['height']

mean    182.4
std       9.1
Name: height, dtype: float64

# 4.Find a sportsperson participated in the 2002 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?

In [68]:
# Encuentre un deportista que participó en los Juegos Olímpicos de 2002, 
# con el mayor peso entre los demás participantes de los mismos Juegos Olímpicos. 
#¿Qué deporte hizo él o ella?

data[(data['year'] == 2002)]['weight'].max()

123.0

In [66]:
data[(data['year'] == 2002) & (data['weight'] == 123.0)]

,id,name,sex,age,height,weight,team,noc,games,year,season,city,sport,event,medal
99154,50171,Emmanuel Hostache,M,26.0,190.0,123.0,France,FRA,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Two,NaN

# 5. How many times did Pawe Abratkiewicz participate in the Olympics held in different years?

In [71]:
# ¿Cuántas veces participó Paw Bratkiewicz en los Juegos Olímpicos celebrados en diferentes años?

data[data['name'] == 'Pawe Abratkiewicz'].groupby(by=['year']).count()

,id,name,sex,age,height,weight,team,noc,games,season,city,sport,event,medal
year,,,,,,,,,,,,,,
1992,2,2,2,2,2,2,2,2,2,2,2,2,2,0
1998,2,2,2,2,2,2,2,2,2,2,2,2,2,0
2002,2,2,2,2,2,2,2,2,2,2,2,2,2,0

# 6. How many silver medals in tennis did Australia win at the 2000 Olympics?

In [76]:
print(list(data['noc'].unique()))

['CHN', 'DEN', 'NED', 'USA', 'FIN', 'NOR', 'ROU', 'EST', 'FRA', 'MAR', 'ESP', 'EGY', 'IRI', 'BUL', 'ITA', 'CHA', 'AZE', 'SUD', 'RUS', 'ARG', 'CUB', 'BLR', 'GRE', 'CMR', 'TUR', 'CHI', 'MEX', 'URS', 'NCA', 'HUN', 'NGR', 'ALG', 'KUW', 'BRN', 'PAK', 'IRQ', 'UAR', 'LIB', 'QAT', 'MAS', 'GER', 'CAN', 'IRL', 'AUS', 'RSA', 'ERI', 'TAN', 'JOR', 'TUN', 'LBA', 'BEL', 'DJI', 'PLE', 'COM', 'KAZ', 'BRU', 'IND', 'KSA', 'SYR', 'MDV', 'ETH', 'UAE', 'YAR', 'INA', 'PHI', 'SGP', 'UZB', 'KGZ', 'TJK', 'EUN', 'JPN', 'CGO', 'SUI', 'BRA', 'FRG', 'GDR', 'MON', 'ISR', 'URU', 'SWE', 'ISV', 'SRI', 'ARM', 'CIV', 'KEN', 'BEN', 'UKR', 'GBR', 'GHA', 'SOM', 'LAT', 'NIG', 'MLI', 'AFG', 'POL', 'CRC', 'PAN', 'GEO', 'SLO', 'CRO', 'GUY', 'NZL', 'POR', 'PAR', 'ANG', 'VEN', 'COL', 'BAN', 'PER', 'ESA', 'PUR', 'UGA', 'HON', 'ECU', 'TKM', 'MRI', 'SEY', 'TCH', 'LUX', 'MTN', 'CZE', 'SKN', 'TTO', 'DOM', 'VIN', 'JAM', 'LBR', 'SUR', 'NEP', 'MGL', 'AUT', 'PLW', 'LTU', 'TOG', 'NAM', 'AHO', 'ISL', 'ASA', 'SAM', 'RWA', 'DMA', 'HAI', 'MLT', 'CYP', 'GUI', 'BIZ', 'YMD', 'KOR', 'THA', 'BER', 'ANZ', 'SCG', 'SLE', 'PNG', 'YEM', 'IOA', 'OMA', 'FIJ', 'VAN', 'MDA', 'YUG', 'BAH', 'GUA', 'SRB', 'IVB', 'MOZ', 'CAF', 'MAD', 'MAL', 'BIH', 'GUM', 'CAY', 'SVK', 'BAR', 'GBS', 'TLS', 'COD', 'GAB', 'SMR', 'LAO', 'BOT', 'ROT', 'CAM', 'PRK', 'SOL', 'SEN', 'CPV', 'CRT', 'GEQ', 'BOL', 'SAA', 'AND', 'ANT', 'ZIM', 'GRN', 'HKG', 'LCA', 'FSM', 'MYA', 'MAW', 'ZAM', 'RHO', 'TPE', 'STP', 'MKD', 'BOH', 'TGA', 'LIE', 'MNE', 'GAM', 'COK', 'ALB', 'WIF', 'SWZ', 'BUR', 'NBO', 'BDI', 'ARU', 'NRU', 'VNM', 'VIE', 'BHU', 'MHL', 'KIR', 'UNK', 'TUV', 'NFL', 'KOS', 'SSD', 'LES']

In [91]:
# 6. ¿Cuántas medallas de plata en tenis ganó Australia en los Juegos Olímpicos de 2000?

data[
    (data['year'] == 2000) & (data['noc'] == 'AUS') & (data['sport'] == 'Tennis')
]['medal'].value_counts(dropna=True)

Silver    2
Name: medal, dtype: int64

# 7. Is it true that Switzerland won fewer medals than Serbia at the 2016 Olympics? Do not consider NaN values in Medal column

In [90]:
# 7. ¿Es cierto que Suiza ganó menos medallas que Serbia en los Juegos Olímpicos de 2016? No tener en
# cuenta los valores de NaN en la columna Medalla
# SUI VS SRB

data[
    (data['year'] == 2016) & (data['noc'].isin(['SUI', 'SRB'])) 
].groupby(
    by='noc'
)['medal'].count()

noc
SRB    54
SUI    11
Name: medal, dtype: int64

# 8. What age category did the fewest and the most participants of the 2014 Olympics belong to?

In [92]:
# ¿A qué categoría de edad pertenecía la menor cantidad y la mayor cantidad de participantes de 
# los Juegos Olímpicos de 2014?
jugadores_2014 = data[data['year'] == 2014]

In [96]:
jugadores_2014.agg(['min', 'max'])['age']

min    15.0
max    55.0
Name: age, dtype: float64

In [105]:
conteo_x_age = jugadores_2014['age'].value_counts().sort_index()

In [100]:
jugadores_2014['age'].value_counts(dropna=False, bins=4)

(14.959000000000001, 25.0]    2422
(25.0, 35.0]                  2281
(35.0, 45.0]                   184
(45.0, 55.0]                     4
Name: age, dtype: int64

In [116]:
# Pero las opciones tienen las desigualdades abiertas del lado derecho 
# [15, 25 > 
2422 - conteo_x_age[25], conteo_x_age[15:24].sum()

(2027, 2027)

In [117]:
# [25, 35 >
2281 + conteo_x_age[25] - conteo_x_age[35], conteo_x_age[25:34].sum()

(2594, 2594)

In [118]:
# [35, 45 >
184 + conteo_x_age[35] - conteo_x_age[45], conteo_x_age[35:44].sum()

(265, 265)

In [120]:
# [45, 55]
4 + conteo_x_age[45] , conteo_x_age[45:55].sum()

(5, 5)

# 9. Is it true that there were Summer Olympics held in Lake Placid? Is it true that there were Winter Olympics held in Sankt Moritz? *

In [121]:
data['season'].unique()

array(['Summer', 'Winter'], dtype=object)

In [122]:
data['city'].unique()

array(['Barcelona', 'London', 'Antwerpen', 'Paris', 'Calgary',
       'Albertville', 'Lillehammer', 'Los Angeles', 'Salt Lake City',
       'Helsinki', 'Lake Placid', 'Sydney', 'Atlanta', 'Stockholm',
       'Sochi', 'Nagano', 'Torino', 'Beijing', 'Rio de Janeiro', 'Athina',
       'Squaw Valley', 'Innsbruck', 'Sarajevo', 'Mexico City', 'Munich',
       'Seoul', 'Berlin', 'Oslo', "Cortina d'Ampezzo", 'Melbourne',
       'Roma', 'Amsterdam', 'Montreal', 'Moskva', 'Tokyo', 'Vancouver',
       'Grenoble', 'Sapporo', 'Chamonix', 'St. Louis', 'Sankt Moritz',
       'Garmisch-Partenkirchen'], dtype=object)

In [144]:
# . ¿Es cierto que hubo Juegos Olímpicos de verano en Lake Placid? ¿Es cierto que hubo Olimpiadas
# de Invierno en Sankt Moritz?
data[(data['season'] == 'Summer') & (data['city'].str.contains('Placid'))].shape[0]

0

In [145]:
data[(data['season'] == 'Winter') & (data['city'].str.contains('Moritz'))].shape[0]

1657

In [133]:
# Verificando la existencia de 'Summer'
data[data['city'].str.contains('Placid')]['season'].unique()

array(['Winter'], dtype=object)

In [134]:
# Verificando la existencia de 'Winter'
data[data['city'].str.contains('Moritz')]['season'].unique()

array(['Winter'], dtype=object)

# What is the absolute difference between the number of unique sports at the 1995 Olympics and 2016 Olympics?

In [143]:
# ¿Cuál es la diferencia absoluta entre la cantidad de deportes únicos en los Juegos Olímpicos de 
# 1995 y los Juegos Olímpicos de 2016?

np.abs(
    data[data['year'] == 1995]['sport'].unique().shape[0] - \
    data[data['year'] == 2016]['sport'].unique().shape[0]
)

34